Repository: IrbisSham/score_system
Catalog: lib/l10n/app_*.arb
Languages: ru

# appTitle
source: Score system
ru: Бальная система

# encyclopediaScreenTitle
source: Encyclopedia
ru: Энциклопедия

# encyclopediaTheme
source: Why does system work?
ru: Почему система работает?

# encyclopediaPunkt1Title
source: Need in favor
ru: Потребность в одобрении

# encyclopediaPunkt1Text
source: Children love attention, approval, play - this is inherent in nature. It is important to know that children perceive themselves through the prism of our opinion about them, which we express out loud.\n\nIf we tell children about their achievements, they develop confidence in their abilities, they are no longer afraid of new challenges, as they have their own personal a positive experience is the most important thing for their success in the future. By approving and recording achievements, we form a very important background for their entire future life.
ru: Дети любят внимание, одобрение, игру - это заложено природой. Важно знать, что дети воспринимают себя сквозь призму нашего мнения о них, которое мы высказываем вслух.\n\nЕсли мы говорим детям об их достижениях, у них формируется уверенность в своих возможностях, они уже не боятся новых вызовов, так как имеют свой личный позитивный опыт — это самое важное для их успеха в будущем. Одобрением и фиксированием достижений мы формируем очень очень важный бэкграунд на всю их дальнейшую жизнь.

# encyclopediaPunkt2Title
source: Clear game rules and achievable goals. Dopamine!
ru: Понятные правила игры и достижимые цели. Дофамин!

# encyclopediaPunkt2Text
source: Why do people sometimes go into gaming? Psychologists explain this by the fact that there a person finds simple and achievable goals, easily receives encouragement, collects many "awards" and "approvals" that are disproportionate to his efforts. And although both are intangible, the brain likes it, it receives “cheap” dopamine (the hormone of joy, pleasure). What if such rules were extended to the acquisition of good habits? Any completed task is a checkmark. And the tasks are selected so that they are simple and understandable at the first stages. As for the awards, here parents will be able to act according to the situation, depending on their ideas about education. Encouragement can be in the form of joint leisure with children, shopping, treats, events, interesting hobbies. Every parent knows better what will be more useful and enjoyable.
ru: Почему люди иногда уходят в геймерство? Психологи объясняют это тем, что там человек находит простые и достижимые цели, легко получает поощрение, собирает много «наград» и «одобрений», несоразмерных его усилиям. И хоть и то, и другое нематериально, мозгу это нравится, он получает «дешевый» дофамин (гормон радости, удовольствия). Что, если такие правила распространить на приобретение полезных привычек? Любое выполненное задание — это галочка. А задания подобраны так, что они просты и понятны на первых этапах. Что касается наград, то здесь родители смогут действовать по обстановке, в зависимости от своих представлений о воспитании. Поощрение может быть в форме совместного досуга с детьми, покупок, угощений, событий, интересных увлечений. Каждый родитель лучше знает, что будет полезнее и приятнее.

# encyclopediaPunkt3Title
source: Not a drop of addiction, on the contrary - new qualities of character, new heights.
ru: Ни капли привыкания, наоборот — новые качества характера, новые высоты.

# encyclopediaPunkt3Text
source: A baby tracker helps to develop a habit, it is no longer required. Any child will gladly want to do unloved things himself, if he sees additional value in this. Each time he receives positive reinforcement, he gradually gets used to doing routines and does not need further encouragement. His reward is the result: "I could", "I did it." For the parent, it will be noticeable that in addition to the fulfilled requests and deeds, the child has developed new useful qualities of his character and has become more successful in general.
ru: Детский трекер помогает выработать привычку, дальше он не требуется. Любой ребенок с радостью захочет сделать нелюбимые дела сам, если увидит в этом дополнительную ценность. Каждый раз получая позитивное подкрепление, он постепенно привыкает к выполнению рутин и в дальнейшем не нуждается в поощрении. Его наградой становится результат: «Я смог», «Я это сделал». Для родителя же будет заметно, что помимо выполненных просьб и дел, ребенок развил новые полезные качества своего характера и стал успешнее в целом.

# encyclopediaPunkt4Title
source: Conclusion, briefly about everything
ru: Вывод, кратко обо всем

# encyclopediaPunkt4Text
source: Kids will love putting away toys, laying out clothes, keeping things clean, doing homework, going to bed on time, and more. In return, they will receive the ability to work, value time and resources, and achieve what they want with their work. But most importantly, they will acquire key character traits that will help them achieve adult goals in the future and in the present.
ru: Дети полюбят убирать игрушки, раскладывать одежду, следить за чистотой, делать уроки, ложиться спать во время и многое другое. Взамен они получат умение работать, ценить время и ресурсы, добиваться желаемого своим трудом. Но самое главное — они приобретут ключевые качества характера, которые помогут достигать взрослых целей в будущем и в настоящем.

# encyclopediaPunkt5Title
source: Introduction to the game
ru: Введение в игру

# encyclopediaPunkt5Text
source: The purpose of the game is to teach the child (and, if necessary, learn it yourself) to happily perform routine tasks without any extra effort. The victory condition for the child is to take responsibility for a certain work or action, to do it qualitatively. The victory for the parent is to teach the child to order and create a positive association for him for life, so that even without the use of the system, cleaning and any routine can be done easily. Bonus - in the process of accustoming another, you learn yourself. A reward for a child is a reward that the child chooses, but you can do without it - at later stages. Reward for the parent - Responsible child assistants, full-fledged family members, and not just freeloaders-guests.
ru: Цель игры — научить ребенка (и если надо, научиться самому) с радостью выполнять рутинные дела без лишних усилий. Условие победы для ребенка — взять ответственность за определенную работу или действие, сделать его качественно. Победа для родителя — приучить чадо к порядку и создать ему позитивную ассоциацию на всю жизнь, чтобы и без применения системы уборка и любая рутина выполнялась легко. Бонус — в процессе приучения другого учишься и сам. Награда ребенку — поощрение, которое выберет сам ребенок, но можно обойтись и без него — на более поздних этапах. Награда родителю — Ответственные дети-помощники, полноценные члены семьи, а не просто нахлебники-гости.

# encyclopediaPunkt6Title
source: The history of the tracker
ru: История создания трекера

# encyclopediaPunkt6Text
source: Sometimes we, parents, are afraid to pay attention to children's achievements, approve, praise, so as not to “frighten away” the results. In our family, disorder in children's things, disorganization and some indifference of children were commonplace. We constantly lacked the strength to change everything, to make a revolution, to teach children to maintain order and beauty. And yes, there was nothing to praise. And then one day we heard from a famous Russian psychologist, mother of 11 children, this: "Try the point system, don't be afraid, it's not harmful." We had doubts for a long time, we thought that our children would think only in terms of points, think only about “earnings”, but there was simply no other way out, the mess from the nursery multiplied endlessly and “strangled” us. We decided and started a poster with actions and marks in points for each. The system performed well immediately.
ru: Иногда мы, родители, боимся уделять внимание детским достижениям, одобрять, хвалить, чтобы «не спугнуть» результаты. В нашей семье беспорядок в детских вещах, неорганизованность и некоторое равнодушие детей было обычным делом. Нам постоянно не хватало сил все изменить, произвести революцию, научить детей поддерживать порядок и красоту. Да и хвалить было как-то не за что. И вот однажды мы услышали от известного российского психолога, мамы 11 детей, такое: «Попробуйте бальную систему, не бойтесь, это не вредно». Мы долго сомневались, думали, что наши дети станут мыслить одними баллами, думать только о «заработке», однако другого выхода уже просто не было, бардак из детской бесконечно множился и «душил» нас. Мы решились и завели плакатик с действиями и оценками в баллах за каждое. Система сразу показала себя хорошо.

# userNewScreenTitle
source: New user
ru: Новый пользователь

# userScreenChoosePhoto
source: Choose photo
ru: Выбрать фото

# userNewScreenParticipation
source: Will you participate?
ru: Вы будете участвовать?

# userNewScreenPartDesc
source: You can track your new healthy habits with your kids. Play together!
ru: Вы можете отслеживать свои новые полезные привычки вместе с детьми. Играем вместе!

# userNameUndefined
source: Unknown
ru: Неизвестный

# userNameTitle
source: Enter your name
ru: Представьтесь

# emailNameTitle
source: Enter your email
ru: Введите вашу почту

# emailNameValidatorMessage
source: Enter a valid email address
ru: Введите корректный почтовый адрес

# buttonReady
source: Ready
ru: Готово

# unsupportedError
source: Not realised yet
ru: Еще не реализовано
